In [1]:
import pandas as pd

In [2]:
muvi=pd.read_csv('imdb_1000.csv')

In [3]:
muvi.head(5)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [4]:
muvi['content_rating'].isnull().sum()

3

In [5]:
ok=muvi.isnull().sum()

In [6]:
len(ok)

6

In [7]:
muvi['content_rating'].unique()

array(['R', 'PG-13', 'NOT RATED', 'PG', 'UNRATED', 'APPROVED', 'PASSED',
       'G', 'X', nan, 'TV-MA', 'GP', 'NC-17'], dtype=object)

In [8]:
high_rate=muvi.star_rating>9

In [9]:
muvi[high_rate]

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

In [10]:
yewe=muvi[high_rate]

In [11]:
len(yewe)

3

In [12]:
byeri=pd.read_csv('drinks.csv',index_col=False)

In [13]:
byeri.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [14]:
kunywa=byeri.sort_values('beer_servings',ascending=False)

In [15]:
kunywa.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
117,Namibia,376,3,1,6.8,Africa
45,Czech Republic,361,170,134,11.8,Europe
62,Gabon,347,98,59,8.9,Africa
65,Germany,346,117,175,11.3,Europe
98,Lithuania,343,244,56,12.9,Europe

In [16]:
byeri.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [17]:
kunywa=byeri.beer_servings+ byeri.spirit_servings

In [18]:
kunywa.head()

0      0
1    221
2     25
3    383
4    274
dtype: int64

In [19]:
byeri.groupby(kunywa).max().tail()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
531,Czech Republic,361,170,134,11.8,Europe
558,Poland,343,215,56,10.9,Europe
573,Russian Federation,247,326,73,11.5,Asia
587,Lithuania,343,244,56,12.9,Europe
637,Grenada,199,438,28,11.9,North America

In [20]:
byeri['highest_between_beer_and_spirit']=byeri.beer_servings+ byeri.spirit_servings

In [21]:
byeri.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
0,Afghanistan,0,0,0,0.0,Asia,0
1,Albania,89,132,54,4.9,Europe,221
2,Algeria,25,0,14,0.7,Africa,25
3,Andorra,245,138,312,12.4,Europe,383
4,Angola,217,57,45,5.9,Africa,274

In [22]:
byeri.sort_values(['highest_between_beer_and_spirit','country'],ascending=False).head(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
68,Grenada,199,438,28,11.9,North America,637

In [23]:
yewe=byeri.loc[byeri['country'].isin(['Benin', 'Burkina Faso', 'Cape Verde', 'Gambia', 'Ghana', 'Guinea', 'Guinea-Bissau', 'Ivory Coast', 'Liberia', 'Mali', 'Mauritania', 'Niger', 'Nigeria', 'Senegal', 'Sierra Leone','Togo'])]

In [24]:
yewe.sort_values(['total_litres_of_pure_alcohol','country'],ascending=True).head(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
107,Mauritania,0,0,0,0.0,Africa,0

In [25]:
byeri.loc[byeri['country'].isin(['Rwanda','Uganda','Tanzania','DR Congo','Burundi'])].sort_values(['total_litres_of_pure_alcohol','country'],ascending=False).head(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
179,Uganda,45,9,0,8.3,Africa,54

In [26]:
mubue=byeri['beer_servings'].max()

In [27]:
mubue

376

In [28]:
kunywa=byeri.beer_servings.max()

In [29]:
byeri.groupby('continent').beer_servings.max()

continent
Africa           376
Asia             247
Europe           361
North America    285
Oceania          306
South America    333
Name: beer_servings, dtype: int64

In [30]:
byeri.sort_values('beer_servings',ascending=False).head(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
117,Namibia,376,3,1,6.8,Africa,379

In [31]:
byeri.groupby('continent').spirit_servings.max()

continent
Africa           152
Asia             326
Europe           373
North America    438
Oceania          254
South America    302
Name: spirit_servings, dtype: int64

In [32]:
byeri.sort_values('spirit_servings',ascending=False).head(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
68,Grenada,199,438,28,11.9,North America,637

In [33]:
byeri.sort_values('wine_servings',ascending=False).head(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
61,France,127,151,370,11.8,Europe,278

In [34]:
afurika=byeri[byeri.continent=='Africa']
application=afurika.sort_values('beer_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
117,Namibia,376,3,1,6.8,Africa,379

In [35]:
afurika=byeri[byeri.continent=='Africa']
application=afurika.sort_values('spirit_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
96,Liberia,19,152,2,3.1,Africa,171

In [36]:
afurika=byeri[byeri.continent=='Africa']
application=afurika.sort_values('wine_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
55,Equatorial Guinea,92,0,233,5.8,Africa,92

In [37]:
isi=byeri[byeri.continent=='Europe']
yewe=isi.sort_values('beer_servings',ascending=False)
yewe[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
45,Czech Republic,361,170,134,11.8,Europe,531

In [38]:
isi=byeri[byeri.continent=='Europe']
yewe=isi.sort_values('spirit_servings',ascending=False)
yewe[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
15,Belarus,142,373,42,14.4,Europe,515

In [39]:
isi=byeri[byeri.continent=='Europe']
yewe=isi.sort_values('wine_servings',ascending=False)
yewe[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
61,France,127,151,370,11.8,Europe,278

In [40]:
isi=byeri[byeri.continent=='North America']
yewe=isi.sort_values('beer_servings',ascending=False)
yewe[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
130,Panama,285,104,18,7.2,North America,389

In [41]:
isi=byeri[byeri.continent=='North America']
yewe=isi.sort_values('spirit_servings',ascending=False)
yewe[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
68,Grenada,199,438,28,11.9,North America,637

In [42]:
isi=byeri[byeri.continent=='North America']
yewe=isi.sort_values('wine_servings',ascending=False)
yewe[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
32,Canada,240,122,100,8.2,North America,362

In [43]:
afurika=byeri[byeri.continent=='Asia']
application=afurika.sort_values('beer_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
141,Russian Federation,247,326,73,11.5,Asia,573

In [44]:
afurika=byeri[byeri.continent=='Asia']
application=afurika.sort_values('spirit_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
141,Russian Federation,247,326,73,11.5,Asia,573

In [45]:
afurika=byeri[byeri.continent=='Asia']
application=afurika.sort_values('wine_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
92,Laos,62,0,123,6.2,Asia,62

In [46]:
byeri.continent.unique()

array(['Asia', 'Europe', 'Africa', 'North America', 'South America',
       'Oceania'], dtype=object)

In [47]:
afurika=byeri[byeri.continent=='South America']
application=afurika.sort_values('beer_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
188,Venezuela,333,100,3,7.7,South America,433

In [48]:
afurika=byeri[byeri.continent=='South America']
application=afurika.sort_values('spirit_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
72,Guyana,93,302,1,7.1,South America,395

In [49]:
afurika=byeri[byeri.continent=='South America']
application=afurika.sort_values('wine_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
6,Argentina,193,25,221,8.3,South America,218

In [50]:
afurika=byeri[byeri.continent=='Oceania']
application=afurika.sort_values('beer_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
129,Palau,306,63,23,6.9,Oceania,369

In [51]:
afurika=byeri[byeri.continent=='Oceania']
application=afurika.sort_values('spirit_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
40,Cook Islands,0,254,74,5.9,Oceania,254

In [52]:
afurika=byeri[byeri.continent=='Oceania']
application=afurika.sort_values('wine_servings',ascending=False)
application[:1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,highest_between_beer_and_spirit
8,Australia,261,72,212,10.4,Oceania,333

In [ ]:
afurika.head()

In [ ]:
east_africa=['Rwanda','Uganda','Tanzania','DR Congo','Burundi'].

In [ ]:
ubwato=pd.read_csv('titanic_train.csv')

In [ ]:
ubwato.head(5)

In [ ]:
ubwato[ubwato.Survived==1].Age.mean()

In [ ]:
ubwato.Pclass

In [ ]:
yewe=ubwato.groupby('Pclass').count()

In [ ]:
yewe.head()

In [ ]:
byeri.loc[byeri['country'].isin(['Algeria','Egypt','Libya','Morocco','Sudan','Tunisia','Western Sahara'])].sort_values('total_litres_of_pure_alcohol',ascending=False).head(1)

In [ ]:
yewe=ubwato.groupby('Sex').count()

In [ ]:
yewe

In [ ]:
ubwato[ubwato.Survived==1].Sex.max()

In [ ]:
ufo=pd.read_csv('ufo.csv')

In [ ]:
ufo.head()

In [ ]:
ok=byeri.loc[byeri['country'].isin(['Angola', 'Botswana', 'Comoros', 'DR Congo', 'Eswatini', 'Lesotho', 'Madagascar', 'Malawi', 'Mauritius', 'Mozambique', 'Namibia', 'Seychelles', 'South Africa', 'Tanzania', 'Zambia', 'Zimbabwe'])].sort_values('total_litres_of_pure_alcohol',ascending=False)

In [ ]:
ok[2:3]

In [ ]:
ufo.memory_usage(index=False)

In [ ]:
ufo.memory_usage(index=False).max()

In [ ]:
ufo.memory_usage(deep=True,index=False)

In [ ]:
ufo.info(memory_usage='deep')

In [ ]:
ufo['City'] = ufo.City.astype('category')

In [ ]:
ufo.City.unique()

In [ ]:
ufo.City.cat.codes.head(10)

In [ ]:
ufo.head()

In [ ]:
ufo.memory_usage(deep=True)

In [ ]:
ufo.City.nunique()

In [ ]:
ufo.State = ufo.City.astype('category')
ufo.memory_usage(deep=True)

In [ ]:
ufo.State.cat.categories

In [ ]:
import numpy as np

### Code below is another research i have made on reducing the memory

In [ ]:
def reduce_memory(ufo):
    start = ufo.memory_usage().sum() / 1024**2
    print('Memory usage of dataframe is {:.2f} MB'.format(start))

    for col in ufo.columns:
        col_type = ufo[col].dtype
    if col_type != object:
            minimum = ufo[col].min()
            maximum = ufo[col].max()
            if str(col_type)[:3] == 'int':
                if minimum > np.iinfo(np.int8).min and maximum < np.iinfo(np.int8).max:
                    ufo[col] = ufo[col].astype(np.int8)
                elif minimum > np.iinfo(np.uint8).min and maximum < np.iinfo(np.uint8).max:
                    ufo[col] = ufo[col].astype(np.uint8)
                elif minimum > np.iinfo(np.int16).min and maximum < np.iinfo(np.int16).max:
                    ufo[col] = ufo[col].astype(np.int16)
                elif minimum > np.iinfo(np.uint16).min and maximum < np.iinfo(np.uint16).max:
                    ufo[col] = ufo[col].astype(np.uint16)
                elif minimum > np.iinfo(np.int32).min and maximum < np.iinfo(np.int32).max:
                    ufo[col] = ufo[col].astype(np.int32)
                elif minimum > np.iinfo(np.uint32).min and maximum < np.iinfo(np.uint32).max:
                    ufo[col] = ufo[col].astype(np.uint32)                    
                elif minimum > np.iinfo(np.int64).min and maximum < np.iinfo(np.int64).max:
                    ufo[col] = ufo[col].astype(np.int64)
                elif minimum > np.iinfo(np.uint64).min and maximum < np.iinfo(np.uint64).max:
                    ufo[col] = ufo[col].astype(np.uint64)
            else:
                if minimum > np.finfo(np.float16).min and maximum < np.finfo(np.float16).max:
                    ufo[col] = ufo[col].astype(np.float16)
                elif minimum > np.finfo(np.float32).min and maximum < np.finfo(np.float32).max:
                    ufo[col] = ufo[col].astype(np.float32)
                else:
                    ufo[col] = ufo[col].astype(np.float64)

    end_mem = ufo.memory_usage().sum() / 1024**2
    print('Memory usage after optimization is: {:.2f} MB'.format(end_mem))
    print('Decreased by {:.1f}%'.format(100 * (start - end_mem) / start))
    
    return ufo

In [ ]:
reduce_memory(ufo).head()

#####  memory has decreased by 0
 this returns the memory used by every column in bytes.  then we sum the column usages and divide the value by 1024², we get the usage in MB(megabytes).

In [ ]:
ok=byeri.loc[byeri['country'].isin(['France', 'USA', 'Japan', 'Canada', 'Italy', 'United Kingdom', 'Germany'])].sort_values('total_litres_of_pure_alcohol',ascending=True)

In [ ]:
ok[:1]

In [ ]:
yemwe=pd.DataFrame(muvi.items(),columns=['genre','content_rating'])

In [ ]:
from sklearn.model_selection import train_test_split
trainingSet, testSet = train_test_split(muvi, test_size=0.3)

In [ ]:
len(trainingSet)

In [ ]:
len(testSet)

In [ ]:
birth=pd.read_csv('daily-total-female-births.csv')

In [ ]:
birth.head(3)

In [ ]:
birth.dtypes

In [ ]:
birth['Date'] = pd.to_datetime(birth['Date'], errors='coerce')

In [ ]:
birth['Weekday'] = birth.Date.dt.weekday_name

In [ ]:
birth.head()

In [ ]:
birth['DayOfyear'] = birth.Date.dt.dayofyear

In [ ]:
birth.head()

In [ ]:
birth['Month']=birth.Date.dt.month

In [ ]:
birth.head()

In [ ]:
ts = pd.to_datetime('1/1/1999')
ts

In [ ]:
birth.loc[birth.Date <= ts, :].head()

In [ ]:
birth.Date.max()-birth.Date.min()

In [ ]:
birth['Year']=birth.Date.dt.year

In [ ]:
birth.head(9)

In [ ]:
birth.sort_values(['Births','Month'],ascending=False).head(1)

In [ ]:
birth.sort_values('Births',ascending=False).head(1)

In [ ]:
birth.sort_values(['Births','Weekday'],ascending=False).head(1)

In [ ]:
birth.sort_values(['Births','DayOfyear'],ascending=False).head(1)